sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/responses/shells/shell1.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:Shell xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLShells/">
            <Name>Blunt gaper</Name>
            <ScientificName>Mya truncata</ScientificName>
            <Slogan>Not too long ago, I was dancing for dollars (eeoow)</Slogan>
            <Persons>
                <PersonId>1</PersonId>
                <PersonId>2</PersonId>
            </Persons>
            <Costumes>
                <CostumeId>1</CostumeId>
            </Costumes>
        </ns2:Shell>
    </S:Body>
</S:Envelope>
